using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Data;
using SQS.DataStructure;

namespace SQS.Controller
{
    public class InputManagementCtrl
    {
        #region Paper
        /// <summary>
        /// 根据路径导入论文Excel
        /// </summary>
        /// <param name="path">指定的路径</param>
        /// <param name="createCount">新增数量</param>
        /// <param name="updateCount">更新数量</param>
        /// <param name="exception"></param>
        /// <returns>导入成功返回true，否则返回false</returns>
        public static bool InportPaperExcel(string path, ref int createCount, ref int updateCount, ref string exception)
        {
            return true;
        }

        /// <summary>
        /// 获取所有论文信息
        /// </summary>
        /// <param name="table">（ID, Depart, Office, Name, PaperName, JournalName, PublishDate, PublishGrade, RewardGrade, RewardClass, WordCount, AutherCount, Auther1, Auther2, Auther3）</param>
        /// <param name="exception"></param>
        /// <returns>查询成功且结果不为空返回true，否则返回false</returns>
        public static bool GetAllPaperInformation(ref DataTable table, ref string exception)
        {
            table.Columns.Add("ID");
            table.Columns.Add("Depart");
            table.Columns.Add("Office");
            table.Columns.Add("Name");
            table.Columns.Add("PaperName");
            table.Columns.Add("JournalName");
            table.Columns.Add("PublishDate");
            table.Columns.Add("PublishGrade");
            table.Columns.Add("RewardGrade");
            table.Columns.Add("RewardClass");
            table.Columns.Add("WordCount");
            table.Columns.Add("AutherCount");
            table.Columns.Add("Auther1");
            table.Columns.Add("Auther2");
            table.Columns.Add("Auther3");
            table.Rows.Add("1", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("2", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("3", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("4", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("5", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("6", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("7", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("8", "基层政治工作系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("9", "基层政治工作系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("10", "基层政治工作系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("11", "基层政治工作系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("12", "基层政治工作系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("13", "基层政治工作系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("14", "基层政治工作系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("15", "基层政治工作系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("16", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("17", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("18", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("19", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("10", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("20", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("21", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("22", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("23", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("24", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("25", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("26", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("27", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("28", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("29", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            return true;
        }

        /// <summary>
        /// 根据搜索条件获取文论信息（部系、处室、发表级别、奖励级别、奖励等级均是获取名称，非ID）
        /// </summary>
        /// <param name="table">（ID, Depart, Office, Name, PaperName, JournalName, PublishDate, PublishGrade, RewardGrade, RewardClass, WordCount, AutherCount, Auther1, Auther2, Auther3）</param>
        /// <param name="searchCondition">搜索条件</param>
        /// <param name="exception"></param>
        /// <returns>查询成功且结果不为空返回true，否则返回false</returns>
        public static bool GetPaperInformationByCondition(ref DataTable table, SearchCondition searchCondition, ref string exception)
        {
            table.Columns.Add("ID");
            table.Columns.Add("Depart");
            table.Columns.Add("Office");
            table.Columns.Add("Name");
            table.Columns.Add("PaperName");
            table.Columns.Add("JournalName");
            table.Columns.Add("PublishDate");
            table.Columns.Add("PublishGrade");
            table.Columns.Add("RewardGrade");
            table.Columns.Add("RewardClass");
            table.Columns.Add("WordCount");
            table.Columns.Add("AutherCount");
            table.Columns.Add("Auther1");
            table.Columns.Add("Auther2");
            table.Columns.Add("Auther3");
            table.Rows.Add("1", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("2", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("3", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("4", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("5", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("6", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("7", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("8", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("9", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("10", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("11", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("12", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("13", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("14", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("15", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("16", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("17", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("18", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("19", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("10", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("20", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("21", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("22", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("23", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("24", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("25", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("26", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("27", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("28", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            table.Rows.Add("29", "军事安全保卫系", "刑侦", "张钢", "军地互涉刑事案件侦查管辖权限界分原则", "武警政治学院学报", "2013.01", "内部期刊", " ", " ", "3000", "1", "*", "", "");
            return true;
        }

        /// <summary>
        /// 根据记录ID获取论文信息
        /// </summary>
        /// <param name="paper">论文信息</param>
        /// <param name="id">记录ID</param>
        /// <param name="exception"></param>
        /// <returns>获取成功返回true，否则返回false</returns>
        public static bool GetPaperById(ref Paper paper, string id, ref string exception)
        {
            paper.Id = "12";
            paper.DepartId = "2";
            paper.OfficeId = "3";
            paper.Name = "高2";
            paper.PaperName = "论文名称";
            paper.JournalName = "会议名称";
            paper.PublishDate = "1898-3";
            paper.PublishGradeId = "3";
            paper.RewardGradeId = "4";
            paper.RewardClassId = "2";
            paper.WordCount = 4000;
            paper.AutherCount = 3;
            paper.AutherOrder = 2;
            return true;
        }

        /// <summary>
        /// 更新论文信息
        /// </summary>
        /// <param name="paper"></param>
        /// <param name="exception"></param>
        /// <returns>更新成功返回true，否则返回false</returns>
        public static bool UpdatePaper(Paper paper, ref string exception)
        {
            return true;
        }

        /// <summary>
        /// 删除指定id的论文
        /// </summary>
        /// <param name="idList">ID列表</param>
        /// <param name="exception"></param>
        /// <returns>删除成功返回true，否则返回false</returns>
        public static bool DeletePapersByIds(List<string> idList, ref string exception)
        {
            return true;
        }
        #endregion Paper

        #region Topic
        /// <summary>
        /// 根据路径导入Excel
        /// </summary>
        /// <param name="path">指定的路径</param>
        /// <param name="createCount">新增数量</param>
        /// <param name="updateCount">更新数量</param>
        /// <param name="exception"></param>
        /// <returns>导入成功返回true，否则返回false</returns>
        public static bool InportTopicExcel(string path, ref int createCount, ref int updateCount, ref string exception)
        {
            return true;
        }

        /// <summary>
        /// 获取所有课题信息
        /// </summary>
        /// <param name="table">(ID, Depart, Office, Name, TopicName, TopicGrade, StartTime, StopTime, RewardGrade, RewardClass, CompleteType, WordCount, AutherCount, Auther1, Auther2, Auther3, Auther4, Auther5)</param>
        /// <param name="exception"></param>
        /// <returns>查询成功且结果不为空返回true，否则返回false</returns>
        public static bool GetAllTopicInformation(ref DataTable table, ref string exception)
        {
            table.Columns.Add("ID");
            table.Columns.Add("Depart");
            table.Columns.Add("Office");
            table.Columns.Add("Name");
            table.Columns.Add("TopicName");
            table.Columns.Add("TopicGrade");
            table.Columns.Add("StartTime");
            table.Columns.Add("StopTime");
            table.Columns.Add("RewardGrade");
            table.Columns.Add("RewardClass");
            table.Columns.Add("CompleteType");
            table.Columns.Add("WordCount");
            table.Columns.Add("AutherCount");
            table.Columns.Add("Auther1");
            table.Columns.Add("Auther2");
            table.Columns.Add("Auther3");
            table.Columns.Add("Auther4");
            table.Columns.Add("Auther5");
            table.Rows.Add("1", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("2", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("3", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("4", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("5", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("6", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("7", "机关政治工作系", "宣传文化教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("8", "机关政治工作系", "宣传文化教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("9", "机关政治工作系", "宣传文化教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("10", "机关政治工作系", "宣传文化教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("11", "机关政治工作系", "宣传文化教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("12", "机关政治工作系", "宣传文化教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("13", "机关政治工作系", "宣传文化教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("14", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("15", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("16", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("17", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("18", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("19", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("20", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("21", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("22", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("23", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("24", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("25", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("26", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("27", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("28", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("29", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("30", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("31", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("32", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("33", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("34", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            return true;
        }

        /// <summary>
        /// 根据搜索条件获取课题信息
        /// </summary>
        /// <param name="table">(ID, Depart, Office, Name, TopicName, TopicGrade, StartTime, StopTime, RewardGrade, RewardClass, CompleteType, WordCount, AutherCount, Auther1, Auther2, Auther3, Auther4, Auther5)</param>
        /// <param name="searchCondition">搜索条件</param>
        /// <param name="exception"></param>
        /// <returns>查询成功且结果不为空返回true，否则返回false</returns>
        public static bool GetTopicInformationByCondition(ref DataTable table, SearchCondition searchCondition, ref string exception)
        {
            table.Columns.Add("ID");
            table.Columns.Add("Depart");
            table.Columns.Add("Office");
            table.Columns.Add("Name");
            table.Columns.Add("TopicName");
            table.Columns.Add("TopicGrade");
            table.Columns.Add("StartTime");
            table.Columns.Add("StopTime");
            table.Columns.Add("RewardGrade");
            table.Columns.Add("RewardClass");
            table.Columns.Add("CompleteType");
            table.Columns.Add("WordCount");
            table.Columns.Add("AutherCount");
            table.Columns.Add("Auther1");
            table.Columns.Add("Auther2");
            table.Columns.Add("Auther3");
            table.Columns.Add("Auther4");
            table.Columns.Add("Auther5");
            table.Rows.Add("1", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("2", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("3", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("4", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("5", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("6", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("7", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("8", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("9", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("10", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("11", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("12", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("13", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("14", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("15", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("16", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("17", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("18", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("19", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("20", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("21", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("22", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("23", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("24", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("25", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("26", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("27", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("28", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("29", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("30", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("31", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("32", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("33", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            table.Rows.Add("34", "机关政治工作系", "组织工作教研室", "王辉", "边疆民族地区维稳政治攻势研究", "武警部队军事理论课题", "2012年3月", "2012年10月", "武警部队", "三等奖", "研究报告", "50000", " ", " ", " ", "*", " ", " ");
            return true;
        }

        /// <summary>
        /// 根据记录ID获取课题信息
        /// </summary>
        /// <param name="topic">课题信息</param>
        /// <param name="id">记录ID</param>
        /// <param name="exception"></param>
        /// <returns>获取成功返回true，否则返回false</returns>
        public static bool GetTopicById(ref Topic topic, string id, ref string exception)
        {
            topic.Id = "2";
            topic.DepartId = "4";
            topic.OfficeId = "3";
            topic.Name = "高1";
            topic.TopicName = "课题名称";
            topic.TopicGradeId = "2";
            topic.StartTime = "2013-3";
            topic.StopTime = "2015-9";
            topic.RewardGradeId = "1";
            topic.RewardClassId = "5";
            topic.CompleteType = "完成形式";
            topic.WordCount = 50000;
            topic.AutherCount = 3;
            topic.AutherOrder = 2;
            return true;
        }

        /// <summary>
        /// 更新课题信息
        /// </summary>
        /// <param name="topic"></param>
        /// <param name="exception"></param>
        /// <returns>更新成功返回true，否则返回false</returns>
        public static bool UpdateTopic(Topic topic, ref string exception)
        {
            return true;
        }

        /// <summary>
        /// 删除指定id的课题
        /// </summary>
        /// <param name="idList">ID列表</param>
        /// <param name="exception"></param>
        /// <returns>删除成功返回true，否则返回false</returns>
        public static bool DeleteTopicsByIds(List<string> idList, ref string exception)
        {
            return true;
        }
        #endregion Topic

        #region Book
        /// <summary>
        /// 根据路径导入著作Excel
        /// </summary>
        /// <param name="path">指定的路径</param>
        /// <param name="createCount">新增数量</param>
        /// <param name="updateCount">更新数量</param>
        /// <param name="exception"></param>
        /// <returns>导入成功返回true，否则返回false</returns>
        public static bool InportBookExcel(string path, ref int createCount, ref int updateCount, ref string exception)
        {
            return true;
        }

        /// <summary>
        /// 获取所有著作信息
        /// </summary>
        /// <param name="table">(ID, Depart, Office, Name, BookName, Press, PublishDate, PublishGrade, RewardGrade, RewardClass, WordCount, AutherCount, Auther1, Auther2, Auther3, Auther4, Auther5)</param>
        /// <param name="exception"></param>
        /// <returns>查询成功且结果不为空返回true，否则返回false</returns>
        public static bool GetAllBookInformation(ref DataTable table, ref string exception)
        {
            table.Columns.Add("ID");
            table.Columns.Add("Depart");
            table.Columns.Add("Office");
            table.Columns.Add("Name");
            table.Columns.Add("BookName");
            table.Columns.Add("Press");
            table.Columns.Add("PublishDate");
            table.Columns.Add("PublishGrade");
            table.Columns.Add("RewardGrade");
            table.Columns.Add("RewardClass");
            table.Columns.Add("WordCount");
            table.Columns.Add("AutherCount");
            table.Columns.Add("Auther1");
            table.Columns.Add("Auther2");
            table.Columns.Add("Auther3");
            table.Columns.Add("Auther4");
            table.Columns.Add("Auther5");

            table.Rows.Add("1", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("2", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("3", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("4", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("5", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("6", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("7", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("8", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("9", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("10", "机关政治工作系", "宣传文化教研室1", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("11", "机关政治工作系", "宣传文化教研室1", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("12", "机关政治工作系", "宣传文化教研室1", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("13", "机关政治工作系", "宣传文化教研室1", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("14", "机关政治工作系", "宣传文化教研室1", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("15", "机关政治工作系", "宣传文化教研室1", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("16", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("17", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("18", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("19", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("20", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("21", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("22", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("23", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("24", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("25", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("26", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("27", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("28", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("29", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("30", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("31", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("32", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            return true;
        }

        /// <summary>
        /// 根据搜索条件获取著作信息
        /// </summary>
        /// <param name="table">查询结果</param>
        /// <param name="searchCondition">搜索条件</param>
        /// <param name="exception"></param>
        /// <returns>查询成功且结果不为空返回true，否则返回false</returns>
        public static bool GetBookInformationByCondition(ref DataTable table, SearchCondition searchCondition, ref string exception)
        {
            table.Columns.Add("ID");
            table.Columns.Add("Depart");
            table.Columns.Add("Office");
            table.Columns.Add("Name");
            table.Columns.Add("BookName");
            table.Columns.Add("Press");
            table.Columns.Add("PublishDate");
            table.Columns.Add("PublishGrade");
            table.Columns.Add("RewardGrade");
            table.Columns.Add("RewardClass");
            table.Columns.Add("WordCount");
            table.Columns.Add("AutherCount");
            table.Columns.Add("Auther1");
            table.Columns.Add("Auther2");
            table.Columns.Add("Auther3");
            table.Columns.Add("Auther4");
            table.Columns.Add("Auther5");

            table.Rows.Add("1", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("2", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("3", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("4", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("5", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("6", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("7", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("8", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("9", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("10", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("11", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("12", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("13", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("14", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("15", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("16", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("17", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("18", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("19", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("20", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("21", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("22", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("23", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("24", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("25", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("26", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("27", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("28", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("29", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("30", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("31", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            table.Rows.Add("32", "机关政治工作系", "宣传文化教研室", "杨明伟", "军队思想政治教育文化资源研究", "人民武警出版社", "2013.5", "内部发行", " ", " ", "4000", "3", "*", " ", " ", " ", " ");
            return true;
        }

        /// <summary>
        /// 根据记录ID获取著作信息
        /// </summary>
        /// <param name="book">著作信息</param>
        /// <param name="id">记录ID</param>
        /// <param name="exception"></param>
        /// <returns>获取成功返回true，否则返回false</returns>
        public static bool GetBookById(ref Book book, string id, ref string exception)
        {
            book.Id = "3";
            book.DepartId = "2";
            book.OfficeId = "1";
            book.Name = "高3";
            book.BookName = "著作名称";
            book.Press = "出版社";
            book.PublishDate = "2013-9";
            book.PublishGradeId = "2";
            book.RewardGradeId = "1";
            book.RewardClassId = "-1";
            book.WordCount = 5000; ;
            book.AutherCount = 2;
            book.AutherOrder = 1;
            return true;
        }

        /// <summary>
        /// 更新著作信息
        /// </summary>
        /// <param name="paper"></param>
        /// <param name="exception"></param>
        /// <returns>更新成功返回true，否则返回false</returns>
        public static bool UpdateBook(Book book, ref string exception)
        {
            return true;
        }

        /// <summary>
        /// 删除指定id的著作
        /// </summary>
        /// <param name="idList">ID列表</param>
        /// <param name="exception"></param>
        /// <returns>删除成功返回true，否则返回false</returns>
        public static bool DeleteBooksByIds(List<string> idList, ref string exception)
        {
            return true;
        }
        #endregion

        #region Staff
        /// <summary>
        /// 根据路径导入人员Excel
        /// </summary>
        /// <param name="path">指定的路径</param>
        /// <param name="exception"></param>
        /// <returns>导入成功返回true，否则返回false</returns>
        public static bool InportStaffExcel(string path, ref string exception)
        {
            return true;
        }

        /// <summary>
        /// 获取所有人员信息
        /// </summary>
        /// <param name="departStaffInformationList">查询结果</param>
        /// <param name="exception"></param>
        /// <returns>查询成功且结果不为空返回true，否则返回false</returns>
        public static bool GetAllStaffInformation(ref List<DepartStaffInformation> departStaffInformationList, ref string exception)
        {
            OfficeStaffInformation office1 = new OfficeStaffInformation("处室1", 2);
            OfficeStaffInformation office2 = new OfficeStaffInformation("处室2", 2);
            OfficeStaffInformation office3 = new OfficeStaffInformation("处室3", 3);
            OfficeStaffInformation office4 = new OfficeStaffInformation("处室4", 4);
            OfficeStaffInformation office5 = new OfficeStaffInformation("处室5", 5);
            OfficeStaffInformation office6 = new OfficeStaffInformation("处室6", 6);
            OfficeStaffInformation office7 = new OfficeStaffInformation("处室7", 7);
            OfficeStaffInformation office8 = new OfficeStaffInformation("处室8", 8);
            OfficeStaffInformation office9 = new OfficeStaffInformation("处室9", 2);
            OfficeStaffInformation office10 = new OfficeStaffInformation("处室10", 2);
            OfficeStaffInformation office11 = new OfficeStaffInformation("处室11", 2);
            OfficeStaffInformation office12 = new OfficeStaffInformation("处室12", 2);
            OfficeStaffInformation office13 = new OfficeStaffInformation("处室13", 2);
            OfficeStaffInformation office14 = new OfficeStaffInformation("处室14", 2);
            OfficeStaffInformation office15 = new OfficeStaffInformation("处室15", 2);
            OfficeStaffInformation office16 = new OfficeStaffInformation("处室16", 2);
            OfficeStaffInformation office17 = new OfficeStaffInformation("处室17", 2);
            OfficeStaffInformation office18 = new OfficeStaffInformation("处室18", 2);
            OfficeStaffInformation office19 = new OfficeStaffInformation("处室19", 2);
            OfficeStaffInformation office20 = new OfficeStaffInformation("处室20", 2);
            OfficeStaffInformation office21 = new OfficeStaffInformation("处室21", 2);
            OfficeStaffInformation office22 = new OfficeStaffInformation("处室22", 2);
            OfficeStaffInformation office23 = new OfficeStaffInformation("处室23", 2);
            OfficeStaffInformation office24 = new OfficeStaffInformation("处室24", 2);
            OfficeStaffInformation office25 = new OfficeStaffInformation("处室25", 2);
            OfficeStaffInformation office26 = new OfficeStaffInformation("处室26", 2);

            DepartStaffInformation depart1 = new DepartStaffInformation("部系1");
            DepartStaffInformation depart2 = new DepartStaffInformation("部系1");
            DepartStaffInformation depart3 = new DepartStaffInformation("部系1");
            DepartStaffInformation depart4 = new DepartStaffInformation("部系1");
            DepartStaffInformation depart5 = new DepartStaffInformation("部系1");
            DepartStaffInformation depart6 = new DepartStaffInformation("部系1");

            depart1.AddOffice(office1);
            depart1.AddOffice(office2);
            depart1.AddOffice(office3);
            depart1.AddOffice(office4);
            depart1.AddOffice(office5);
            depart2.AddOffice(office6);
            depart2.AddOffice(office7);
            depart2.AddOffice(office8);
            depart2.AddOffice(office9);
            depart2.AddOffice(office10);
            depart2.AddOffice(office11);
            depart3.AddOffice(office12);
            depart3.AddOffice(office13);
            depart3.AddOffice(office14);
            depart3.AddOffice(office15);
            depart4.AddOffice(office16);
            depart4.AddOffice(office17);
            depart4.AddOffice(office18);
            depart5.AddOffice(office19);
            depart6.AddOffice(office20);
            depart6.AddOffice(office21);
            depart6.AddOffice(office22);
            depart6.AddOffice(office23);
            depart6.AddOffice(office24);
            depart6.AddOffice(office25);
            depart6.AddOffice(office26);

            departStaffInformationList.Add(depart1);
            departStaffInformationList.Add(depart2);
            departStaffInformationList.Add(depart3);
            departStaffInformationList.Add(depart4);
            departStaffInformationList.Add(depart5);
            departStaffInformationList.Add(depart6);
            return true;
        }
        #endregion

        #region Common

        #endregion
    }
}
